In [1]:
import pandas as pd
df1 = pd.DataFrame({
    'Salario': [30000,45000,38000],
    'Antiguedad': [9,13,12]},
    index=[1,2,3])

df2= pd.DataFrame(
    {
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia'],
        'Jerarquia': ['Baja', 'Alta', 'Media']},
    index=[1,2,4])

In [2]:
df1

   Salario  Antiguedad
1    30000           9
2    45000          13
3    38000          12

In [3]:
df2

      Ciudad Jerarquia
1     Madrid      Baja
2  Barcelona      Alta
4   Valencia     Media

In [4]:
## antes con merge FUSIONAMOS, con join, se COMBINA. Consiste en unir pero a partir del index o columna clave y no columna compartida

In [5]:
df_unido = df1.join(df2)
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta
3    38000          12        NaN       NaN

In [6]:
df_unido = df1.join(df2, how='inner')
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta